In [1]:
import pandas as pd

In [2]:
#empty df

df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 0 entries
Empty DataFrame

In [4]:
#This data type is totally empty.

In [5]:
city =['Berlin','Elrangen', 'Zurich']

In [7]:
df = pd.DataFrame(city)
df

          0
0    Berlin
1  Elrangen
2    Zurich

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
type(city)

list

In [10]:
row, col =df.shape

In [11]:
row

3

In [12]:
col

1

In [14]:
df.shape
#first number is row, seccond number is column

(3, 1)

In [15]:
df

          0
0    Berlin
1  Elrangen
2    Zurich

In [20]:
df=pd.DataFrame(city, columns=['city_in_Europe'])
df

  city_in_Europe
0         Berlin
1       Elrangen
2         Zurich

In [24]:
df=pd.DataFrame(city, columns=['city_in_Europe'], index=['c1','c2','c3'])
df

#we can change serial number

   city_in_Europe
c1         Berlin
c2       Elrangen
c3         Zurich

In [28]:
city2= ['BD', 'Italy', "Europe"]
df2 =pd.DataFrame(zip(city,city2), columns=['city1', 'city2'])
df2

      city1   city2
0    Berlin      BD
1  Elrangen   Italy
2    Zurich  Europe

In [29]:
df

   city_in_Europe
c1         Berlin
c2       Elrangen
c3         Zurich

In [30]:
df.shape

(3, 1)

In [31]:
df2.shape

(3, 2)

In [33]:
city3=[['Kushtia','Mirpur'], ['Sherpur', 'katlamari']]
city3

[['Kushtia', 'Mirpur'], ['Sherpur', 'katlamari']]

In [35]:
df4 =pd.DataFrame(city3)
df4

         0          1
0  Kushtia     Mirpur
1  Sherpur  katlamari

In [36]:
df4 =pd.DataFrame(city3, columns =['state', 'city'])
df4

     state       city
0  Kushtia     Mirpur
1  Sherpur  katlamari

In [37]:
dict1 ={ 'city1': ['Italy', 'Rome', 'Pavia'],
          'city2': ['Canada','Usa','Argentia']
}

In [40]:
df6 = pd.DataFrame(dict1)
df6

   city1     city2
0  Italy    Canada
1   Rome       Usa
2  Pavia  Argentia

In [41]:
type(dict1)

dict

In [42]:
# Now I working with csv file importing

In [43]:
df = pd.read_csv('Screen Time.csv')

In [44]:
df

,index,Date,Week Day,Total Screen Time,Social Networking,Reading and Reference,Other,Productivity,Health and Fitness,Entertainment,Creativity,Yoga
0,0,4/17/2023,Wednesday,187,89,17,41,22,0,0,0,0
1,1,4/18/2023,Thursday,123,78,17,8,9,0,0,0,0
2,2,4/19/2023,Friday,112,52,40,8,4,0,3,0,0
3,3,4/20/2023,Saturday,101,69,9,38,2,0,3,0,0
4,4,4/21/2023,Sunday,56,35,2,43,3,0,1,1,0
5,5,4/22/2023,Monday,189,68,0,9,3,4,0,0,0
6,6,4/23/2023,Tuesday,158,56,18,41,12,15,0,0,0
7,7,4/24/2023,Wednesday,135,98,3,33,16,0,0,0,0
8,8,4/25/2023,Thursday,52,25,7,3,16,0,0,0,0
9,9,4/26/2023,Friday,198,76,8,29,15,0,32,0,0
10,10,4/27/2023,Saturday,116,75,10,20,5,0,0,0,0
11,11,4/28/2023,Sunday,85,42,22,4,2,0,0,0,0
12,12,4/29/2023,Monday,109,46,8,13,9,15,1,0,1
13,13,4/30/2023,Tuesday,79,40,2,9,12,0,0,0,1
14,14,5/1/2023,Wednesday,127,90,0,10,7,0,0,0,1
15,15,5/2/2023,Thursday,170,60,3,2,11,0,0,0,1
16,16,5/3/2023,Friday,91,64,2,18,5,1,1,2,1
17,17,5/4/2023,Saturday,58,34,4,5,3,0,1,0,1
18,18,5/5/2023,Sunday,133,109,5,1,3,0,0,0,1
19,19,5/6/2023,Monday,144,81,4,5,3,0,0,0,1
20,20,5/7/2023,Tuesday,110,70,5,6,15,0,9,0,1
21,21,5/8/2023,Wednesday,122,53,25,26,15,0,0,0,1
22,22,5/9/2023,Thursday,96,42,15,16,19,0,0,0,1
23,23,5/10/2023,Friday,161,93,13,17,16,1,0,0,1
24,24,5/11/2023,Saturday,58,49,1,2,2,0,0,2,1
25,25,5/12/2023,Sunday,52,28,1,1,6,0,0,1,1
26,26,5/13/2023,Monday,61,37,1,0,4,0,0,0,1
27,27,5/14/2023,Tuesday,88,41,2,7,15,0,0,0,1